{
    "infusions": [
        {
            "name": "Arcane Propulsion Armor",
            "description": "The wearer of this armor gains these benefits: - The wearer's walking speed increases by 5 feet. - The armor includes gauntlets, each of which is a magic melee weapon that can be wielded only when the hand is holding nothing. The wearer is proficient with the gauntlets, and each one deals 1d8 force damage on a hit and has the thrown property, with a normal range of 20 feet and a long range of 60 feet. When thrown, the gauntlet detaches and flies at the attack's target, then immediately returns to the wearer and reattaches. - The armor can't be removed against the wearer's will. - If the wearer is missing any limbs, the armor replaces those limbs - hands, arms, feet, legs, or similar appendages. The replacements function identically to the body parts they replace.",
            "preReq": 14
        },
        {
            "name": "Armor of Magical Strength",
            "description": "This armor has 6 charges. The wearer can expend the armor's charges in the following ways: - When the wearer makes a Strength check or a Strength saving throw, it can expend 1 charge to add a bonus to the roll equal to its Intelligence modifier. - If the creature would be knocked prone, it can use its reaction to expend 1 charge to avoid being knocked prone. The armor regains 1d6 expended charges daily at dawn.",
            "preReq": 0
        },
        {
            "name": "Armor of Tools",
            "description": "As an action, a creature wearing this infused armor can integrate into it artisan’s tools or thieves’ tools. The tools remain integrated in the armor for 8 hours or until the wearer removes the tools as an action. The armor can have only one tool integrated at a time. The wearer can add its Intelligence modifier to any ability checks it makes with the integrated tool. The wearer must have a hand free to use the tool.",
            "preReq": 0
        },
        {
            "name": "Boots of the Winding Path",
            "description": "While wearing these boots, a creature can teleport up to 15 feet as a bonus action to an unoccupied space the creature can see. The creature must have occupied that space at some point during the current turn.",
            "preReq": 6
        },
        {
            "name": "Enhanced Arcane Focus",
            "description": "While holding this item, a creature gains +1 bonus to spell attack rolls. in addition, the creature ignores half cover when making a spell attack. The bonus increases to +2 when you reach 10th level in this class.",
            "preReq": 0
        },
        {
            "name": "Enhanced Defense",
            "description": "A creature gains a +1 bonus to Armor Class while wearing (armor) or wielding (shield) the infused item. The bonus increases to +2 when you reach 10th level in this class.",
            "preReq": 0
        },
        {
            "name": "Enhanced Weapon",
            "description": "This magic weapon grants a +1 bonus to attack and damage rolls made with it. The bonus increases to +2 when you reach 10th level in this class.",
            "preReq": 0
        },
        {
            "name": "Helm of Awareness",
            "description": "While wearing this helmet, a creature has advantage on initiative rolls. In addition, the wearer can’t be surprised, provided it isn’t incapacitated.",
            "preReq": 10
        },
        {
            "name": "Homunculus Servant",
            "description": "You learn intricate methods for magically creating a special homunculus that serves you. The item you infuse serves as the creature's heart, around which the creature's body instantly forms. (construct information can be found in your character sheet)",
            "preReq": 0
        },
        {
            "name": "Mind Sharpener",
            "description": "The infused item can send a jolt to the wearer to refocus their mind. The item has 4 charges. When the wearer fails a Constitution saving throw to maintain concentration on a spell, the wearer can use its reaction to expend 1 of the item's charges to succeed instead. The item regains 1d4 expended charges daily at dawn.",
            "preReq": 0
        },
        {
            "name": "Radiant Weapon",
            "description": "This magic weapon grants a + 1 bonus to attack and damage rolls made with it. While holding it, the wielder can take a bonus action to cause it to shed bright light in a 30-foot radius and dim light for an additional 30 feet. The wielder can extinguish the light as a bonus action. The weapon has 4 charges. As a reaction immediately after being hit by an attack, the wielder can expend 1 charge and cause the attacker to be blinded until the end of the attacker's next turn, unless the attacker succeeds on a Constitution saving throw against your spell save DC. The weapon regains ld4 expended charges daily at dawn.",
            "preReq": 6
        },
        {
            "name": "Repeating Shot",
            "description": "This magic weapon grants a + 1 bonus to attack and damage rolls made with it when it's used to make a ranged attack, and it ignores the loading property if it has it. If you load no ammunition in the weapon, it produces its own, automatically creating one piece of magic ammunition when you make a ranged attack with it. The ammunition created by the weapon vanishes the instant after it hits or misses a target.",
            "preReq": 0
        }
    ]
}