{
    "Fighter": {
        "level": {
            "1": {
                "I": {
                    "name": "Second Wind",
                    "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again"
                }
            },
            "2": {
                "I": {
                    "name": "Action Surge I",
                    "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
                }
            },
            "5": {
                "I": {
                    "name": "Extra Attack I",
                    "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
                }
            },
            "9": {
                "I": {
                    "name": "Indomitable I",
                    "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
                }
            },
            "11": {
                "I": {
                    "name": "Extra Attack II",
                    "description": "Beginning at 11th level, you can attack three times, instead of twice, whenever you take the Attack action on your turn. The number of attacks increases to four when you reach 20th level in this class."
                }
            },
            "13": {
                "I": {
                    "name": "Indomitable II",
                    "description": "Indomitable is now available twice between long rests"
                }
            },
            "17": {
                "I": {
                    "name": "Action Surge II",
                    "description": "Action Surge is now available twice between long rests"
                },
                "II": {
                    "name": "Indomitable III",
                    "description": "Indomitable is now available Three times between long rests"
                }
            },
            "20": {
                "I": {
                    "name": "Extra Attack III",
                    "description": "At 20th level, you can attack four times, instead of three, whenever you take the Attack action on your turn."
                }
            }
        }
    },
    "Barbarian": {
        "level": {
            "1": {
                "I": {
                    "name": "Rage",
                    "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren’t wearing heavy armor: You have advantage on Strength checks and Strength saving throws.  When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
                },
                "II": {
                    "name": "Unarmored Defense",
                    "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
                }
            },
            "2": {
                "I": {
                    "name": "Reckless Attack",
                    "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
                },
                "II": {
                    "name": "Danger Sense",
                    "description": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
                }
            },
            "3": {
                "I": {
                    "name": "Primal Path",
                    "description": "At 3rd level, you choose a path that shapes the nature of your rage. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
                }
            },
            "5": {
                "I": {
                    "name": "Extra Attack",
                    "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                },
                "II": {
                    "name": "Fast Movement",
                    "description": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
                }
            },
            "7": {
                "I": {
                    "name": "Feral Instinct",
                    "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
                }
            },
            "9": {
                "I": {
                    "name": "Brutal Critical",
                    "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."
                }
            },
            "11": {
                "I": {
                    "name": "Relentless Rage",
                    "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
                }
            },
            "13": {
                "I": {
                    "name": "Brutal Critical II",
                    "description": "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack. This increases to three additional dice at 17th level."
                }
            },
            "15": {
                "I": {
                    "name": "Persistent Rage",
                    "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
                }
            },
            "17": {
                "I": {
                    "name": "Brutal Critical III",
                    "description": "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
                }
            },
            "18": {
                "I": {
                    "name": "Indomitable Might",
                    "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
                }
            },
            "20": {
                "I": {
                    "name": "Primal Champion",
                    "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
                }
            }
        }
    },
    "Bard": {
        "level": {
            "1": {
                "I": {
                    "name": "Spellcasting",
                    "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations."
                },
                "II": {
                    "name": "Bardic Inspiration I",
                    "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
                }
            },
            "2": {
                "I": {
                    "name": "Jack of All Trades",
                    "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus."
                },
                "II": {
                    "name": "Song of Rest I",
                    "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
                }
            },
            "3": {
                "I": {
                    "name": "Bard Collage",
                    "description": "At 3rd level, you delve into the advanced techniques of a bard college of your choice."
                },
                "II": {
                    "name": "Expertise",
                    "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
                }
            },
            "5": {
                "I": {
                    "name": "Font of Inspiration",
                    "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
                },
                "II": {
                    "name": "Bardic Inspiration II",
                    "description": "Bardic Inspiration die is now a d8"
                }
            },
            "6": {
                "I": {
                    "name": "Countercharm",
                    "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
                }
            },
            "9": {
                "I": {
                    "name": "Song of Rest II",
                    "description": "Song of Rest die is now a d8"
                }
            },
            "10": {
                "I": {
                    "name": "Bardic Inspiration III",
                    "description": "Bardic Inspiration die is now a d10"
                },
                "II": {
                    "name": "Magical Secrets I",
                    "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 14th level and again at 18th level."
                }
            },
            "13": {
                "I": {
                    "name": "Song of Rest III",
                    "description": "Song of Rest die is now a d10"
                }
            },
            "14": {
                "I": {
                    "name": "Magical Secrets II",
                    "description": "At 14th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any classes at 18th level."
                }
            },
            "15": {
                "I": {
                    "name": "Bardic Inspiration IV",
                    "description": "Bardic Inspiration die is now a d12"
                }
            },
            "17": {
                "I": {
                    "name": "Song of Rest IV",
                    "description": "Song of Rest die is now a d12"
                }
            },
            "18": {
                "I": {
                    "name": "Magical Secrets II",
                    "description": "At 18th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table."
                }
            },
            "20": {
                "I": {
                    "name": "Superior Inspiration",
                    "description": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
                }
            }
        }
    },
    "Druid": {
        "level": {
            "1": {
                "I": {
                    "name": "Druidic",
                    "description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message’s presence with a successful DC 15 Wisdom (Perception) check but can’t decipher it without magic."
                },
                "II": {
                    "name": "Spellcasting",
                    "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See Spells Rules for the general rules of spellcasting and the Spells Listing for the druid spell list."
                }
            },
            "2": {
                "I": {
                    "name": "Wild Shape",
                    "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn’t have a flying or swimming speed."
                },
                "II": {
                    "name": "Druid Circle",
                    "description": "At 2nd level, you choose to identify with a circle of druids. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level. "
                }
            },
            "4": {
                "I": {
                    "name": "Wild Shape Improvement I",
                    "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
                }
            },
            "8": {
                "I": {
                    "name": "Wild Shape Improvement II",
                    "description": "At 8th level, you can use your action to magically assume the shape of a beast that you have seen before of challenge rating 1 or lower. You can use this feature twice. You regain expended uses when you finish a short or long rest."
                }
            },
            "18": {
                "I": {
                    "name": "Timeless Body",
                    "description": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
                },
                "II": {
                    "name": "Beast Spells",
                    "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components."
                }
            },
            "20": {
                "I": {
                    "name": "Archdruid",
                    "description": "At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren’t consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
                }
            }
        }
    },
    "Cleric": {
        "level": {
            "1": {
                "I": {
                    "name": "Spellcasting",
                    "description": "As a conduit for divine power, you can cast cleric spells. See Spells Rules for the general rules of spellcasting and the Spells Listing for the cleric spell list."
                },
                "II": {
                    "name": "Divine Domain",
                    "description": "Choose one domain related to your deity Your choice grants you domain spells and other features when you choose it at 1st level."
                }
            },
            "2": {
                "I": {
                    "name": "Channel Divinity I",
                    "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC"
                }
            },
            "5": {
                "I": {
                    "name": "Destroy Undead I",
                    "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as follows: Cleric Level - 5th. Undead Challenge rating - 1/2 or lower"
                }
            },
            "6": {
                "I": {
                    "name": "Channel Divinity II",
                    "description": "Beginning at 6th level, you can use your Channel Divinity twice between rests."
                }
            },
            "8": {
                "I": {
                    "name": "Destroy Undead II",
                    "description": "Destroy undead now applies to the following, Cleric Level - 8th. Undead Challenge rating - 1 or lower."
                }
            },
            "10": {
                "I": {
                    "name": "Divine Intervention I",
                    "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. Imploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. "
                }
            },
            "11": {
                "I": {
                    "name": "Destroy Undead III",
                    "description": "Destroy undead now applies to the following, Cleric Level - 11th. Undead Challenge rating - 2 or lower."
                }
            },
            "14": {
                "I": {
                    "name": "Destroy Undead IV",
                    "description": "Destroy undead now applies to the following, Cleric Level - 14th. Undead Challenge rating - 3 or lower."
                }
            },
            "17": {
                "I": {
                    "name": "Destroy Undead V",
                    "description": "Destroy undead now applies to the following, Cleric Level - 17th. Undead Challenge rating - 4 or lower."
                }
            },
            "18": {
                "I": {
                    "name": "Channel Divinity III",
                    "description": "Beginning at 18th level, you can use your Channel Divinity three times between rests."
                }
            },
            "20": {
                "I": {
                    "name": "Divine Intervention II",
                    "description": "At 20th level, your call for intervention succeeds automatically, no roll required."
                }
            }
        }
    },
    "Monk": {
        "level": {
            "1": {
                "I": {
                    "name": "Unarmored Defense",
                    "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
                },
                "II": {
                    "name": "Martial Arts",
                    "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two-handed or heavy property. You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield: 1 - You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons. 2 - You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels. 3 - When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven’t already taken a bonus action this turn."
                }
            },
            "2": {
                "I": {
                    "name": "Ki",
                    "description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have. You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points. Some of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows: Ki save DC = 8 + your proficiency bonus + your Wisdom modifier"
                },
                "II": {
                    "name": "Flurry of Blows",
                    "description": "Immediately after you take the Attack action on Your Turn, you can spend 1 ki point to make two unarmed strikes as a Bonus Action."
                },
                "III": {
                    "name": "Patient Defense",
                    "description": "You can spend 1 ki point to take the Dodge action as a Bonus Action on Your Turn."
                },
                "IV": {
                    "name": "Step of the Wind",
                    "description": "You can spend 1 ki point to take the Disengage or Dash action as a Bonus Action on Your Turn, and your jump distance is doubled for the turn."
                },
                "V": {
                    "name": "Unarmored Movement",
                    "description": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels."
                }
            },
            "3": {
                "I": {
                    "name": "Deflect Missiles",
                    "description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet."
                }
            },
            "4": {
                "I": {
                    "name": "Slow Fall",
                    "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
                }
            },
            "5": {
                "I": {
                    "name": "Extra Attack",
                    "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                },
                "II": {
                    "name": "Stunning Strike",
                    "description": "Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
                }
            },
            "6": {
                "I": {
                    "name": "Ki-Empowered Strikes",
                    "description": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
                }
            },
            "7": {
                "I": {
                    "name": "Evasion",
                    "description": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
                },
                "II": {
                    "name": "Stillness of Mind",
                    "description": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."
                }
            },
            "9": {
                "I": {
                    "name": "Unarmored Movement Improvement",
                    "description": "At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during your move."
                }
            },
            "10": {
                "I": {
                    "name": "Purity of Body",
                    "description": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison."
                }
            },
            "13": {
                "I": {
                    "name": "Tongue of the Sun and Moon",
                    "description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
                }
            },
            "14": {
                "I": {
                    "name": "Diamond Soul",
                    "description": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
                }
            },
            "15": {
                "I": {
                    "name": "Timeless Body",
                    "description": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can’t be aged magically. You can still die of old age, however. In addition, you no longer need food or water."
                }
            },
            "18": {
                "I": {
                    "name": "Empty Body",
                    "description": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you."
                }
            },
            "20": {
                "I": {
                    "name": "Perfect Self",
                    "description": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
                }
            }
        }
    },
    "Paladin": {
        "level": {
            "1": {
                "I": {
                    "name": "Divine Sense",
                    "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
                },
                "II": {
                    "name": "Lay on Hands",
                    "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs."
                }
            },
            "2": {
                "I": {
                    "name": "Fighting Style",
                    "description": "At 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again."
                },
                "II": {
                    "name": "Spellcasting",
                    "description": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does."
                },
                "III": {
                    "name": "Divine Smite",
                    "description": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
                }
            },
            "3": {
                "I": {
                    "name": "Divine Health",
                    "description": "By 3rd level, the divine magic flowing through you makes you immune to disease."
                },
                "II": {
                    "name": "Sacred Oath",
                    "description": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose the Oath of Devotion detailed at the end of the class description or one from another source."
                }
            },
            "4": {
                "I": {
                    "name": "Slow Fall",
                    "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
                }
            },
            "5": {
                "I": {
                    "name": "Extra Attack",
                    "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                }
            },
            "6": {
                "I": {
                    "name": "Aura of Protection",
                    "description": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet."
                }
            },
            "10": {
                "I": {
                    "name": "Aura of Courage",
                    "description": "Starting at 10th level, you and friendly creatures within 10 feet of you can’t be frightened while you are conscious At 18th level, the range of this aura increases to 30 feet."
                }
            },
            "11": {
                "I": {
                    "name": "Improved Divine Smite",
                    "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."
                }
            },
            "14": {
                "I": {
                    "name": "Cleansing Touch",
                    "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
                }
            },
            "18": {
                "I": {
                    "name": "Aura Improvements",
                    "description": "At 18th level, the range of your auras increase to 30 feet."
                }
            }
        }
    },
    "Ranger": {
        "level": {
            "1": {
                "I": {
                    "name": "Favored Enemy",
                    "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all. You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures."
                },
                "II": {
                    "name": "Natural Explorer",
                    "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits: 1 - Difficult terrain doesn’t slow your group’s travel. 2 - Your group can’t become lost except by magical means. 3 - Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. 4 - If you are traveling alone, you can move stealthily at a normal pace. 5 - When you forage, you find twice as much food as you normally would. 6 - While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area. You choose additional favored terrain types at 6th and 10th level."
                }
            },
            "2": {
                "I": {
                    "name": "Fighting Style",
                    "description": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again."
                },
                "II": {
                    "name": "Spellcasting",
                    "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells"
                }
            },
            "3": {
                "I": {
                    "name": "Ranger Archetype",
                    "description": "At 3rd level, you choose an archetype that you strive to emulate."
                }
            },
            "5": {
                "I": {
                    "name": "Extra Attack",
                    "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
                }
            },
            "6": {
                "I": {
                    "name": "Favored Enemy II",
                    "description": "At 6th level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose an additional type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies."
                },
                "II": {
                    "name": "Natural Explorer II",
                    "description": "At 6th level you can choose an additional favored terrain."
                }
            },
            "8": {
                "I": {
                    "name": "Land’s Stride",
                    "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
                }
            },
            "10": {
                "I": {
                    "name": "Natural Explorer III",
                    "description": "At 10th level you can choose an additional favored terrain."
                },
                "II": {
                    "name": "Hide in Plain Sight",
                    "description": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit."
                }
            },
            "14": {
                "I": {
                    "name": "Favored Enemy III",
                    "description": "At 10th level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose an additional type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies."
                },
                "II": {
                    "name": "Vanish",
                    "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail."
                }
            },
            "18": {
                "I": {
                    "name": "Feral Senses",
                    "description": "At 18th level, you gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened."
                }
            },
            "20": {
                "I": {
                    "name": "Foe Slayer",
                    "description": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
                }
            }
        }
    },
    "Rogue": {
        "level": {
            "1": {
                "I": {
                    "name": "Sneak Attack",
                    "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe’s distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. You don’t need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage on the attack roll. The amount of the extra damage increases as you gain levels in this class."
                },
                "II": {
                    "name": "Thieves’ Cant",
                    "description": "During your rogue training you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves’ cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves’ guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
                }
            },
            "2": {
                "I": {
                    "name": "Cunning Action",
                    "description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
                }
            },
            "3": {
                "I": {
                    "name": "Roguish Archetype",
                    "description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities"
                }
            },
            "5": {
                "I": {
                    "name": "Uncanny Dodge",
                    "description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you."
                }
            },
            "7": {
                "I": {
                    "name": "Evasion",
                    "description": "eginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as an ancient red dragon’s fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
                }
            },
            "11": {
                "I": {
                    "name": "Reliable Talent",
                    "description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
                }
            },
            "14": {
                "I": {
                    "name": "Blindsense",
                    "description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
                }
            },
            "15": {
                "I": {
                    "name": "Slippery Mind",
                    "description": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
                }
            },
            "18": {
                "I": {
                    "name": "Elusive",
                    "description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren’t incapacitated."
                }
            },
            "20": {
                "I": {
                    "name": "Stroke of Luck",
                    "description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can’t use it again until you finish a short or long rest."
                }
            }
        }
    },
    "Sorcerer": {
        "level": {
            "1": {
                "I": {
                    "name": "Spellcasting",
                    "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells."
                },
                "II": {
                    "name": "Sorcerous Origin",
                    "description": "Choose a sorcerous origin, which describes the source of your innate magical power"
                }
            },
            "2": {
                "I": {
                    "name": "Font of Magic",
                    "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects."
                },
                "II": {
                    "name": "Sorcery Points",
                    "description": "You have 2 sorcery points, and you gain more as you reach higher levels. You regain all spent sorcery points when you finish a long rest. You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels."
                },
                "III": {
                    "name": "Creating Spell Slots",
                    "description": " You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. You can create spell slots no higher in level than 5th. Any spell slot you create with this feature vanishes when you finish a long rest. Spell slot cost: 1st - 2 Sorcery points. 2nd - 3 Sorcery points. 3rd - 5 Sorcery points. 4th - 6 Sorcery points. 5th - 7 Sorcery points."
                }
            },
            "3": {
                "I": {
                    "name": "Metamagic",
                    "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level. You can use only one Metamagic option on a spell when you cast it, unless otherwise noted."
                }
            },
            "20": {
                "I": {
                    "name": "Sorcerous Restoration",
                    "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."
                }
            }
        }
    },
    "Warlock": {
        "level": {
            "1": {
                "I": {
                    "name": "Otherworldly Patron",
                    "description": "At 1st level, you have struck a bargain with an otherworldly being of your choice"
                },
                "II": {
                    "name": "Pact Magic",
                    "description": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells."
                }
            },
            "2": {
                "I": {
                    "name": "Eldritch Invocations",
                    "description": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. At 2nd level, you gain two eldritch invocations of your choice. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. If an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class."
                }
            },
            "11": {
                "I": {
                    "name": "Mystic Arcanum (6th level spells)",
                    "description": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. You regain all uses of your Mystic Arcanum when you finish a long rest."
                }
            },
            "13": {
                "I": {
                    "name": "Mystic Arcanum (7th level spells)",
                    "description": "At 13th level, your patron bestows upon you a magical secret called an arcanum. Choose one 7th-level spell from the warlock spell list as this arcanum. You regain all uses of your Mystic Arcanum when you finish a long rest."
                }
            },
            "15": {
                "I": {
                    "name": "Mystic Arcanum (8th level spells)",
                    "description": "At 15th level, your patron bestows upon you a magical secret called an arcanum. Choose one 8th-level spell from the warlock spell list as this arcanum. You regain all uses of your Mystic Arcanum when you finish a long rest."
                }
            },
            "17": {
                "I": {
                    "name": "Mystic Arcanum (9th level spells)",
                    "description": "At 17th level, your patron bestows upon you a magical secret called an arcanum. Choose one 9th-level spell from the warlock spell list as this arcanum. You regain all uses of your Mystic Arcanum when you finish a long rest."
                }
            },
            "20": {
                "I": {
                    "name": "Eldritch Master",
                    "description": "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
                }
            }
        }
    },
    "Wizard": {
        "level": {
            "1": {
                "I": {
                    "name": "Spellcasting",
                    "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power."
                },
                "II": {
                    "name": "Arcane Recovery",
                    "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. For example, if you’re a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots."
                }
            },
            "2": {
                "I": {
                    "name": "Arcane Tradition",
                    "description": "When you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of the schools available."
                }
            },
            "18": {
                "I": {
                    "name": "Spell Mastery",
                    "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
                }
            },
            "20": {
                "I": {
                    "name": "Signature Spells",
                    "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can’t do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot as normal."
                }
            }
        }
    },
    "Artificer": {
        "level": {
            "1": {
                "I": {
                    "name": "Magical Tinkering",
                    "description": "At 1st level, you've learned how to invest a spark of magic into mundane objects. To use this ability, you must have thieves' tools or artisan's tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice: - The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. - Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long. - The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away. - A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like. The chosen property lasts indefinitely. As an action, you can touch the object and end the property early. You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
                },
                "II": {
                    "name": "Spellcasting",
                    "description": "You've studied the workings of magic and how to cast spells, channeling the magic through objects. To observers, you don't appear to be casting spells in a conventional way; you appear to produce wonders from mundane items and outlandish inventions."
                },
                "III": {
                    "name": "Tools Required For Magic",
                    "description": "You produce your artificer spell effects through your tools. You must have a spellcasting focus-specifically thieves' tools or some kind of artisan's tool-in hand when you cast any spell with this Spellcasting feature (meaning the spell has an 'M' component when you cast it). You must be proficient with the tool to use it in this way. See the equipment chapter in the Player's Handbook for descriptions of these tools. After you gain the Infuse Item feature at 2nd level, you can also use any item bearing one of your infusions as a spellcasting focus."
                }
            },
            "2": {
                "I": {
                    "name": "Infuse Item",
                    "description": "At 2nd level, you've gained the ability to imbue mundane items with certain magical infusions, turning those objects into magic items. When you gain this feature, pick four artificer infusions to learn. You learn additional infusions of your choice when you reach certain levels in this class Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one."
                }
            },
            "3": {
                "I": {
                    "name": "The Right Tool for the Job",
                    "description": "At 3rd level, you've learned how to produce exactly the tool you need: with thieves' tools or artisan's tools in hand, you can magically create one set of artisan's tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."
                }
            },
            "6": {
                "I": {
                    "name": "Tool Expertise",
                    "description": "At 6th level, your proficiency bonus is now doubled for any ability check you make that uses your proficiency with a tool."
                }
            },
            "7": {
                "I": {
                    "name": "Flash of Genius",
                    "description": "At 7th level, you've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll. You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest."
                }
            },
            "10": {
                "I": {
                    "name": "Magic Item Adept",
                    "description": "When you reach 10th level, you achieve a profound understanding of how to use and make magic items: You can attune to up to four magic items at once. - If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."
                }
            },
            "11": {
                "I": {
                    "name": "Spell-Storing Item",
                    "description": "At 11th level, you can now store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a lst- or 2nd-level spell from the artificer spell list that requires 1 action to cast (you needn't have it prepared). While holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object."
                }
            },
            "14": {
                "I": {
                    "name": "Magic Item Savant",
                    "description": "At 14th level, your skill with magic items deepens more: You can attune to up to five magic items at once. You ignore all class, race, spell and level requirements on attuning to or using a magic item."
                }
            },
            "18": {
                "I": {
                    "name": "Magic Item Master",
                    "description": "Starting at 18th level, you can attune up to six magic items at once."
                }
            },
            "20": {
                "I": {
                    "name": "Soul of Artifice",
                    "description": "At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection: You gain a +1 bonus to all saving throws per magic item you are currently attuned to. If you're reduced to 0 hit points but not killed out-right, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0."
                }
            }
        }
    }
}